1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [12]:
import numpy as np
import pandas as pd

In [26]:

l= [1,2,3,4,5,6,7,8,9,10]
t= (1,2,3,4,5,6,7,8,9,10)
s= {1,2,3,4,5,6,7,8,9,10}
i= ["a", "b", "c", "d", "e", "f", "g", "h" , "i", "j"]
l1= pd.Series(l, index=i)
t1= pd.Series(t, index=i)
s1= pd.Series([s])

In [34]:
print(l1, t1, s1)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64 0    {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
dtype: object

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [48]:
d= {'Rahul': 'Dravid',
    'MS': 'Dhoni',
    'Kl': 'Rahul'}
d1= pd.Series(d)
d1

Rahul    Dravid
MS        Dhoni
Kl        Rahul
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
a. Convert it to a list.
b. Convert it to a dictionary.
c. Convert it to a tuple.
d. Convert it to a set.

In [81]:
series5=pd.Series(range(1,11))
series5
l1= list(series5)
l1.

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [83]:
t1= tuple(series5)

t1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [84]:
s1= set(series5)
s1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:

a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [119]:
a=pd.Series(range(10,100,10))

In [120]:
a

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [121]:
#a. Print the first 5 elements of the series
a[-5:]
a[5:11]

5    60
6    70
7    80
8    90
dtype: int64

In [122]:
a.head()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [123]:
#b. Print the last 5 elements of the series
a[-5:]

4    50
5    60
6    70
7    80
8    90
dtype: int64

In [124]:
a[5:]

5    60
6    70
7    80
8    90
dtype: int64

In [129]:
a.tail()
a

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [131]:
#c. Insert an integer value ‘50’ at the index 5.

l1=list(a)
l1.insert(5,55)
l1
a1=pd.Series(l1)
a1

0    10
1    20
2    30
3    40
4    50
5    55
6    60
7    70
8    80
9    90
dtype: int64

In [133]:
#d. Update the last element in the series with the value 100.
a1[10]= 100
a1

0      10
1      20
2      30
3      40
4      50
5      55
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [134]:
#e. Delete the first element from the series.

a1.drop(0)

1      20
2      30
3      40
4      50
5      55
6      60
7      70
8      80
9      90
10    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [148]:
#def search(a,el):
#    if a[el] in a:
#        print(el,'is present')
#    else:
#        print(el,'is not present')
        
#search(a1,20)

#pending

6. For the given series A and B, perform concatenation on the same.
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [154]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
pd.concat([series_A,series_B], ignore_index=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [155]:
sample= pd.Series([1,2,3,4,5,6,7,8,9,10])

for i in sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]

In [166]:
List= [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]      
Dictionary= { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

df1=pd.DataFrame(List)
df

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [168]:
df2=pd.DataFrame(Dictionary)
df2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following

operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [183]:
df=pd.DataFrame({'name': ['rahul', 'dhoni', 'virat', 'rishab','dravid'], 
                 'age': [10,55,14,44,11]})
df

     name  age
0   rahul   10
1   dhoni   55
2   virat   14
3  rishab   44
4  dravid   11

In [184]:
#a. Print the first 3 rows of the Data Frame .

df.head(3)

    name  age
0  rahul   10
1  dhoni   55
2  virat   14

In [189]:
df[0:3]

    name  age
0  rahul   10
1  dhoni   55
2  virat   14

In [186]:
df

     name  age
0   rahul   10
1   dhoni   55
2   virat   14
3  rishab   44
4  dravid   11

In [187]:
#b. Print the rows that have the age greater than 15.

df[df['age']>15]

     name  age
1   dhoni   55
3  rishab   44

In [193]:
df[df.age>15]

     name  age
1   dhoni   55
3  rishab   44

In [194]:
df

     name  age
0   rahul   10
1   dhoni   55
2   virat   14
3  rishab   44
4  dravid   11

In [200]:
#c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

df.loc[5]=['priya', 21]
df

     name   age
0   rahul  10.0
1   dhoni  55.0
2   virat  14.0
3  rishab  44.0
4  dravid  11.0
5   priya  21.0
6    john  50.0

In [203]:
df.loc[6,'name']= 'adam'
df.loc[6,'age']= 55
df

     name   age
0   rahul  10.0
1   dhoni  55.0
2   virat  14.0
3  rishab  44.0
4  dravid  11.0
5   priya  21.0
6    adam  55.0

In [205]:
#d. Update the 5th row so that the name = john and age=56.

df.loc[5]=['john', 56]
df

     name   age
0   rahul  10.0
1   dhoni  55.0
2   virat  14.0
3  rishab  44.0
4  dravid  11.0
5    john  56.0
6    adam  55.0

In [208]:
#e. Delete the first row from the Data Frame .

df.drop(0)

     name   age
1   dhoni  55.0
2   virat  14.0
3  rishab  44.0
4  dravid  11.0
5    john  56.0
6    adam  55.0

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionaryrespectively.

In [215]:
df.values.tolist()

[['rahul', 10.0],
 ['dhoni', 55.0],
 ['virat', 14.0],
 ['rishab', 44.0],
 ['dravid', 11.0],
 ['john', 56.0],
 ['adam', 55.0]]

In [216]:
df.to_dict()

{'name': {0: 'rahul',
  1: 'dhoni',
  2: 'virat',
  3: 'rishab',
  4: 'dravid',
  5: 'john',
  6: 'adam'},
 'age': {0: 10.0, 1: 55.0, 2: 14.0, 3: 44.0, 4: 11.0, 5: 56.0, 6: 55.0}}

11. Create two separate Data Frame s A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, et

In [237]:
#a. Concatenate the two Data Frame s to a new Data Frame C.

A=pd.DataFrame(['rahul', 'dhoni', 'virat', 'rishab','dravid'])
B=pd.DataFrame([10,55,14,44,11])
C= pd.concat([A,B], ignore_index=True)
C

        0
0   rahul
1   dhoni
2   virat
3  rishab
4  dravid
5      10
6      55
7      14
8      44
9      11

In [245]:
#b. Split the Data Frame C row wise.

df_1=C.iloc[:4,:]
df_1

        0
0   rahul
1   dhoni
2   virat
3  rishab

In [250]:
C

        0
0   rahul
1   dhoni
2   virat
3  rishab
4  dravid
5      10
6      55
7      14
8      44
9      11

In [254]:
df_2=C.iloc[4:,:]
df_2

        0
4  dravid
5      10
6      55
7      14
8      44
9      11

12. Create a Data Frame with columns Name and Age. Perform the following operations.

a. Write a sample code to search for the Name/Names where Age is 20.

b. Sort the Data Frame in ascending order of ages.

c. Using Python loops, print the ages from the data frame and store it in a set

In [262]:
df=pd.DataFrame({'name': ['rahul', 'dhoni', 'virat', 'rishab','dravid'], 
                 'age': [10,55,20,44,11]})
df

     name  age
0   rahul   10
1   dhoni   55
2   virat   20
3  rishab   44
4  dravid   11

In [263]:
#a. Write a sample code to search for the Name/Names where Age is 20.

df[df.age == 20]

    name  age
2  virat   20

In [266]:
#b. Sort the Data Frame in ascending order of ages.

df.sort_values('age')

     name  age
0   rahul   10
4  dravid   11
2   virat   20
3  rishab   44
1   dhoni   55

In [268]:
df

     name  age
0   rahul   10
1   dhoni   55
2   virat   20
3  rishab   44
4  dravid   11

In [271]:
#c. Using Python loops, print the ages from the data frame and store it in a set

l=[]

for i in range(len(df)):
    l.append(df.loc[i, 'age'])
print(l)
set1 = set(l)
print(set1)

[10, 55, 20, 44, 11]
{10, 11, 44, 20, 55}